apache/nuttx/arch/risc-v/src/esp32c3/hardware/esp32c3_uart.h
/****************************************************************************
 * arch/risc-v/src/esp32c3/hardware/esp32c3_uart.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_RISCV_SRC_ESP32C3_HARDWARE_ESP32C3_UART_H
#define __ARCH_RISCV_SRC_ESP32C3_HARDWARE_ESP32C3_UART_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "esp32c3_memorymap.h"
#include "esp32c3_soc.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* FIFO Configuration */

/* UART_FIFO_REG register
 *  FIFO data
 *  register
 */

#define UART_FIFO_REG(i) (REG_UART_BASE(i) + 0x0)

/* UART_RXFIFO_RD_BYTE : RO; bitpos: [8:0]; default: 0;
 * UART $n accesses FIFO via this
 * register.
 */

#define UART_RXFIFO_RD_BYTE    0x000000FF
#define UART_RXFIFO_RD_BYTE_M  (UART_RXFIFO_RD_BYTE_V << UART_RXFIFO_RD_BYTE_S)
#define UART_RXFIFO_RD_BYTE_V  0x000000FF
#define UART_RXFIFO_RD_BYTE_S  0

/* UART_MEM_CONF_REG register
 *  UART threshold and allocation
 *  configuration
 */

#define UART_MEM_CONF_REG(i) (REG_UART_BASE(i) + 0x60)

/* UART_RX_SIZE : R/W; bitpos: [4:1]; default: 1;
 * This register is used to configure the amount of mem allocated for
 * receive-FIFO. The default number is 128
 * bytes.
 */

#define UART_RX_SIZE    0x00000007
#define UART_RX_SIZE_M  (UART_RX_SIZE_V << UART_RX_SIZE_S)
#define UART_RX_SIZE_V  0x00000007
#define UART_RX_SIZE_S  1

/* UART_TX_SIZE : R/W; bitpos: [7:4]; default: 1;
 * This register is used to configure the amount of mem allocated for
 * transmit-FIFO. The default number is 128
 * bytes.
 */

#define UART_TX_SIZE    0x00000007
#define UART_TX_SIZE_M  (UART_TX_SIZE_V << UART_TX_SIZE_S)
#define UART_TX_SIZE_V  0x00000007
#define UART_TX_SIZE_S  4

/* UART_RX_FLOW_THRHD : R/W; bitpos: [16:7]; default: 0;
 * This register is used to configure the maximum amount of data that can
 * be received  when hardware flow control
 * works.
 */

#define UART_RX_FLOW_THRHD    0x000001FF
#define UART_RX_FLOW_THRHD_M  (UART_RX_FLOW_THRHD_V << UART_RX_FLOW_THRHD_S)
#define UART_RX_FLOW_THRHD_V  0x000001FF
#define UART_RX_FLOW_THRHD_S  7

/* UART_RX_TOUT_THRHD : R/W; bitpos: [26:16]; default: 10;
 * This register is used to configure the threshold time that receiver
 * takes to receive one byte. The rxfifo_tout_int interrupt will be
 * trigger when the receiver takes more time to receive one byte with
 * rx_tout_en set to
 * 1.
 */

#define UART_RX_TOUT_THRHD    0x000003FF
#define UART_RX_TOUT_THRHD_M  (UART_RX_TOUT_THRHD_V << UART_RX_TOUT_THRHD_S)
#define UART_RX_TOUT_THRHD_V  0x000003FF
#define UART_RX_TOUT_THRHD_S  16

/* UART_MEM_FORCE_PD : R/W; bitpos: [26]; default: 0;
 * Set this bit to force power down UART
 * memory.
 */

#define UART_MEM_FORCE_PD    (BIT(26))
#define UART_MEM_FORCE_PD_M  (UART_MEM_FORCE_PD_V << UART_MEM_FORCE_PD_S)
#define UART_MEM_FORCE_PD_V  0x00000001
#define UART_MEM_FORCE_PD_S  26

/* UART_MEM_FORCE_PU : R/W; bitpos: [27]; default: 0;
 * Set this bit to force power up UART
 * memory.
 */

#define UART_MEM_FORCE_PU    (BIT(27))
#define UART_MEM_FORCE_PU_M  (UART_MEM_FORCE_PU_V << UART_MEM_FORCE_PU_S)
#define UART_MEM_FORCE_PU_V  0x00000001
#define UART_MEM_FORCE_PU_S  27

/* Interrupt Register */

/* UART_INT_RAW_REG register
 *  Raw interrupt
 *  status
 */

#define UART_INT_RAW_REG(i) (REG_UART_BASE(i) + 0x4)

/* UART_RXFIFO_FULL_INT_RAW : R/WTC/SS; bitpos: [0]; default: 0;
 * This interrupt raw bit turns to high level when receiver receives more
 * data than what rxfifo_full_thrhd
 * specifies.
 */

#define UART_RXFIFO_FULL_INT_RAW    (BIT(0))
#define UART_RXFIFO_FULL_INT_RAW_M  (UART_RXFIFO_FULL_INT_RAW_V << UART_RXFIFO_FULL_INT_RAW_S)
#define UART_RXFIFO_FULL_INT_RAW_V  0x00000001
#define UART_RXFIFO_FULL_INT_RAW_S  0

/* UART_TXFIFO_EMPTY_INT_RAW : R/WTC/SS; bitpos: [1]; default: 1;
 * This interrupt raw bit turns to high level when the amount of data in
 * Tx-FIFO is less than what txfifo_empty_thrhd specifies
 * .
 */

#define UART_TXFIFO_EMPTY_INT_RAW    (BIT(1))
#define UART_TXFIFO_EMPTY_INT_RAW_M  (UART_TXFIFO_EMPTY_INT_RAW_V << UART_TXFIFO_EMPTY_INT_RAW_S)
#define UART_TXFIFO_EMPTY_INT_RAW_V  0x00000001
#define UART_TXFIFO_EMPTY_INT_RAW_S  1

/* UART_PARITY_ERR_INT_RAW : R/WTC/SS; bitpos: [2]; default: 0;
 * This interrupt raw bit turns to high level when receiver detects a
 * parity error in the
 * data.
 */

#define UART_PARITY_ERR_INT_RAW    (BIT(2))
#define UART_PARITY_ERR_INT_RAW_M  (UART_PARITY_ERR_INT_RAW_V << UART_PARITY_ERR_INT_RAW_S)
#define UART_PARITY_ERR_INT_RAW_V  0x00000001
#define UART_PARITY_ERR_INT_RAW_S  2

/* UART_FRM_ERR_INT_RAW : R/WTC/SS; bitpos: [3]; default: 0;
 * This interrupt raw bit turns to high level when receiver detects a data
 * frame error
 * .
 */

#define UART_FRM_ERR_INT_RAW    (BIT(3))
#define UART_FRM_ERR_INT_RAW_M  (UART_FRM_ERR_INT_RAW_V << UART_FRM_ERR_INT_RAW_S)
#define UART_FRM_ERR_INT_RAW_V  0x00000001
#define UART_FRM_ERR_INT_RAW_S  3

/* UART_RXFIFO_OVF_INT_RAW : R/WTC/SS; bitpos: [4]; default: 0;
 * This interrupt raw bit turns to high level when receiver receives more
 * data than the FIFO can
 * store.
 */

#define UART_RXFIFO_OVF_INT_RAW    (BIT(4))
#define UART_RXFIFO_OVF_INT_RAW_M  (UART_RXFIFO_OVF_INT_RAW_V << UART_RXFIFO_OVF_INT_RAW_S)
#define UART_RXFIFO_OVF_INT_RAW_V  0x00000001
#define UART_RXFIFO_OVF_INT_RAW_S  4

/* UART_DSR_CHG_INT_RAW : R/WTC/SS; bitpos: [5]; default: 0;
 * This interrupt raw bit turns to high level when receiver detects the
 * edge change of DSRn
 * signal.
 */

#define UART_DSR_CHG_INT_RAW    (BIT(5))
#define UART_DSR_CHG_INT_RAW_M  (UART_DSR_CHG_INT_RAW_V << UART_DSR_CHG_INT_RAW_S)
#define UART_DSR_CHG_INT_RAW_V  0x00000001
#define UART_DSR_CHG_INT_RAW_S  5

/* UART_CTS_CHG_INT_RAW : R/WTC/SS; bitpos: [6]; default: 0;
 * This interrupt raw bit turns to high level when receiver detects the
 * edge change of CTSn
 * signal.
 */

