apache/nuttx/arch/risc-v/src/esp32c3/hardware/esp32c3_uart.h
#define UART_CLKDIV    0x00000FFF
#define UART_CLKDIV_M  (UART_CLKDIV_V << UART_CLKDIV_S)
#define UART_CLKDIV_V  0x00000FFF
#define UART_CLKDIV_S  0

/* UART_CLKDIV_FRAG : R/W; bitpos: [24:20]; default: 0;
 * The decimal part of the frequency divider
 * factor.
 */

#define UART_CLKDIV_FRAG    0x0000000F
#define UART_CLKDIV_FRAG_M  (UART_CLKDIV_FRAG_V << UART_CLKDIV_FRAG_S)
#define UART_CLKDIV_FRAG_V  0x0000000F
#define UART_CLKDIV_FRAG_S  20

/* UART_RX_FILT_REG register
 *  Rx Filter
 *  configuration
 */

#define UART_RX_FILT_REG(i) (REG_UART_BASE(i) + 0x18)

/* UART_GLITCH_FILT : R/W; bitpos: [8:0]; default: 8;
 * when input pulse width is lower than this value, the pulse is
 * ignored.
 */

#define UART_GLITCH_FILT    0x000000FF
#define UART_GLITCH_FILT_M  (UART_GLITCH_FILT_V << UART_GLITCH_FILT_S)
#define UART_GLITCH_FILT_V  0x000000FF
#define UART_GLITCH_FILT_S  0

/* UART_GLITCH_FILT_EN : R/W; bitpos: [8]; default: 0;
 * Set this bit to enable Rx signal
 * filter.
 */

#define UART_GLITCH_FILT_EN    (BIT(8))
#define UART_GLITCH_FILT_EN_M  (UART_GLITCH_FILT_EN_V << UART_GLITCH_FILT_EN_S)
#define UART_GLITCH_FILT_EN_V  0x00000001
#define UART_GLITCH_FILT_EN_S  8

/* UART_CONF0_REG register
 *  a
 */

#define UART_CONF0_REG(i) (REG_UART_BASE(i) + 0x20)

/* UART_PARITY : R/W; bitpos: [0]; default: 0;
 * This register is used to configure the parity check
 * mode.
 */

#define UART_PARITY    (BIT(0))
#define UART_PARITY_M  (UART_PARITY_V << UART_PARITY_S)
#define UART_PARITY_V  0x00000001
#define UART_PARITY_S  0

/* UART_PARITY_EN : R/W; bitpos: [1]; default: 0;
 * Set this bit to enable uart parity
 * check.
 */

#define UART_PARITY_EN    (BIT(1))
#define UART_PARITY_EN_M  (UART_PARITY_EN_V << UART_PARITY_EN_S)
#define UART_PARITY_EN_V  0x00000001
#define UART_PARITY_EN_S  1

/* UART_BIT_NUM : R/W; bitpos: [4:2]; default: 3;
 * This register is used to set the length of
 * data.
 */

#define UART_BIT_NUM    0x00000003
#define UART_BIT_NUM_M  (UART_BIT_NUM_V << UART_BIT_NUM_S)
#define UART_BIT_NUM_V  0x00000003
#define UART_BIT_NUM_S  2

/* UART_STOP_BIT_NUM : R/W; bitpos: [6:4]; default: 1;
 * This register is used to set the length of  stop
 * bit.
 */

#define UART_STOP_BIT_NUM    0x00000003
#define UART_STOP_BIT_NUM_M  (UART_STOP_BIT_NUM_V << UART_STOP_BIT_NUM_S)
#define UART_STOP_BIT_NUM_V  0x00000003
#define UART_STOP_BIT_NUM_S  4

/* UART_SW_RTS : R/W; bitpos: [6]; default: 0;
 * This register is used to configure the software rts signal which is
 * used in software flow
 * control.
 */

#define UART_SW_RTS    (BIT(6))
#define UART_SW_RTS_M  (UART_SW_RTS_V << UART_SW_RTS_S)
#define UART_SW_RTS_V  0x00000001
#define UART_SW_RTS_S  6

/* UART_SW_DTR : R/W; bitpos: [7]; default: 0;
 * This register is used to configure the software dtr signal which is
 * used in software flow
 * control.
 */

#define UART_SW_DTR    (BIT(7))
#define UART_SW_DTR_M  (UART_SW_DTR_V << UART_SW_DTR_S)
#define UART_SW_DTR_V  0x00000001
#define UART_SW_DTR_S  7

/* UART_TXD_BRK : R/W; bitpos: [8]; default: 0;
 * Set this bit to enbale transmitter to  send NULL when the process of
 * sending data is
 * done.
 */

#define UART_TXD_BRK    (BIT(8))
#define UART_TXD_BRK_M  (UART_TXD_BRK_V << UART_TXD_BRK_S)
#define UART_TXD_BRK_V  0x00000001
#define UART_TXD_BRK_S  8

/* UART_IRDA_DPLX : R/W; bitpos: [9]; default: 0;
 * Set this bit to enable IrDA loopback
 * mode.
 */

#define UART_IRDA_DPLX    (BIT(9))
#define UART_IRDA_DPLX_M  (UART_IRDA_DPLX_V << UART_IRDA_DPLX_S)
#define UART_IRDA_DPLX_V  0x00000001
#define UART_IRDA_DPLX_S  9

/* UART_IRDA_TX_EN : R/W; bitpos: [10]; default: 0;
 * This is the start enable bit for IrDA
 * transmitter.
 */

#define UART_IRDA_TX_EN    (BIT(10))
#define UART_IRDA_TX_EN_M  (UART_IRDA_TX_EN_V << UART_IRDA_TX_EN_S)
#define UART_IRDA_TX_EN_V  0x00000001
#define UART_IRDA_TX_EN_S  10

/* UART_IRDA_WCTL : R/W; bitpos: [11]; default: 0;
 * 1'h1: The IrDA transmitter's 11th bit is the same as 10th bit. 1'h0:
 * Set IrDA transmitter's 11th bit to
 * 0.
 */

#define UART_IRDA_WCTL    (BIT(11))
#define UART_IRDA_WCTL_M  (UART_IRDA_WCTL_V << UART_IRDA_WCTL_S)
#define UART_IRDA_WCTL_V  0x00000001
#define UART_IRDA_WCTL_S  11

/* UART_IRDA_TX_INV : R/W; bitpos: [12]; default: 0;
 * Set this bit to invert the level of  IrDA
 * transmitter.
 */

#define UART_IRDA_TX_INV    (BIT(12))
#define UART_IRDA_TX_INV_M  (UART_IRDA_TX_INV_V << UART_IRDA_TX_INV_S)
#define UART_IRDA_TX_INV_V  0x00000001
#define UART_IRDA_TX_INV_S  12

/* UART_IRDA_RX_INV : R/W; bitpos: [13]; default: 0;
 * Set this bit to invert the level of IrDA
 * receiver.
 */

#define UART_IRDA_RX_INV    (BIT(13))
#define UART_IRDA_RX_INV_M  (UART_IRDA_RX_INV_V << UART_IRDA_RX_INV_S)
#define UART_IRDA_RX_INV_V  0x00000001
#define UART_IRDA_RX_INV_S  13

/* UART_LOOPBACK : R/W; bitpos: [14]; default: 0;
 * Set this bit to enable uart loopback test
 * mode.
 */

#define UART_LOOPBACK    (BIT(14))
#define UART_LOOPBACK_M  (UART_LOOPBACK_V << UART_LOOPBACK_S)
#define UART_LOOPBACK_V  0x00000001
#define UART_LOOPBACK_S  14

/* UART_TX_FLOW_EN : R/W; bitpos: [15]; default: 0;
 * Set this bit to enable flow control function for
 * transmitter.
 */

#define UART_TX_FLOW_EN    (BIT(15))
#define UART_TX_FLOW_EN_M  (UART_TX_FLOW_EN_V << UART_TX_FLOW_EN_S)
#define UART_TX_FLOW_EN_V  0x00000001
#define UART_TX_FLOW_EN_S  15

/* UART_IRDA_EN : R/W; bitpos: [16]; default: 0;
 * Set this bit to enable IrDA
 * protocol.
 */

#define UART_IRDA_EN    (BIT(16))
#define UART_IRDA_EN_M  (UART_IRDA_EN_V << UART_IRDA_EN_S)
#define UART_IRDA_EN_V  0x00000001
#define UART_IRDA_EN_S  16

/* UART_RXFIFO_RST : R/W; bitpos: [17]; default: 0;
 * Set this bit to reset the uart
 * receive-FIFO.
 */

#define UART_RXFIFO_RST    (BIT(17))
#define UART_RXFIFO_RST_M  (UART_RXFIFO_RST_V << UART_RXFIFO_RST_S)
#define UART_RXFIFO_RST_V  0x00000001
#define UART_RXFIFO_RST_S  17

/* UART_TXFIFO_RST : R/W; bitpos: [18]; default: 0;
 * Set this bit to reset the uart
 * transmit-FIFO.
 */

