apache/nuttx/arch/risc-v/src/esp32c3/hardware/esp32c3_uart.h
#define UART_TXFIFO_RST    (BIT(18))
#define UART_TXFIFO_RST_M  (UART_TXFIFO_RST_V << UART_TXFIFO_RST_S)
#define UART_TXFIFO_RST_V  0x00000001
#define UART_TXFIFO_RST_S  18

/* UART_RXD_INV : R/W; bitpos: [19]; default: 0;
 * Set this bit to inverse the level value of uart rxd
 * signal.
 */

#define UART_RXD_INV    (BIT(19))
#define UART_RXD_INV_M  (UART_RXD_INV_V << UART_RXD_INV_S)
#define UART_RXD_INV_V  0x00000001
#define UART_RXD_INV_S  19

/* UART_CTS_INV : R/W; bitpos: [20]; default: 0;
 * Set this bit to inverse the level value of uart cts
 * signal.
 */

#define UART_CTS_INV    (BIT(20))
#define UART_CTS_INV_M  (UART_CTS_INV_V << UART_CTS_INV_S)
#define UART_CTS_INV_V  0x00000001
#define UART_CTS_INV_S  20

/* UART_DSR_INV : R/W; bitpos: [21]; default: 0;
 * Set this bit to inverse the level value of uart dsr
 * signal.
 */

#define UART_DSR_INV    (BIT(21))
#define UART_DSR_INV_M  (UART_DSR_INV_V << UART_DSR_INV_S)
#define UART_DSR_INV_V  0x00000001
#define UART_DSR_INV_S  21

/* UART_TXD_INV : R/W; bitpos: [22]; default: 0;
 * Set this bit to inverse the level value of uart txd
 * signal.
 */

#define UART_TXD_INV    (BIT(22))
#define UART_TXD_INV_M  (UART_TXD_INV_V << UART_TXD_INV_S)
#define UART_TXD_INV_V  0x00000001
#define UART_TXD_INV_S  22

/* UART_RTS_INV : R/W; bitpos: [23]; default: 0;
 * Set this bit to inverse the level value of uart rts
 * signal.
 */

#define UART_RTS_INV    (BIT(23))
#define UART_RTS_INV_M  (UART_RTS_INV_V << UART_RTS_INV_S)
#define UART_RTS_INV_V  0x00000001
#define UART_RTS_INV_S  23

/* UART_DTR_INV : R/W; bitpos: [24]; default: 0;
 * Set this bit to inverse the level value of uart dtr
 * signal.
 */

#define UART_DTR_INV    (BIT(24))
#define UART_DTR_INV_M  (UART_DTR_INV_V << UART_DTR_INV_S)
#define UART_DTR_INV_V  0x00000001
#define UART_DTR_INV_S  24

/* UART_CLK_EN : R/W; bitpos: [25]; default: 0;
 * 1'h1: Force clock on for register. 1'h0: Support clock only when
 * application writes
 * registers.
 */

#define UART_CLK_EN    (BIT(25))
#define UART_CLK_EN_M  (UART_CLK_EN_V << UART_CLK_EN_S)
#define UART_CLK_EN_V  0x00000001
#define UART_CLK_EN_S  25

/* UART_ERR_WR_MASK : R/W; bitpos: [26]; default: 0;
 * 1'h1: Receiver stops storing data into FIFO when data is wrong. 1'h0:
 * Receiver stores the data even if the  received data is
 * wrong.
 */

#define UART_ERR_WR_MASK    (BIT(26))
#define UART_ERR_WR_MASK_M  (UART_ERR_WR_MASK_V << UART_ERR_WR_MASK_S)
#define UART_ERR_WR_MASK_V  0x00000001
#define UART_ERR_WR_MASK_S  26

/* UART_AUTOBAUD_EN : R/W; bitpos: [27]; default: 0;
 * This is the enable bit for detecting
 * baudrate.
 */

#define UART_AUTOBAUD_EN    (BIT(27))
#define UART_AUTOBAUD_EN_M  (UART_AUTOBAUD_EN_V << UART_AUTOBAUD_EN_S)
#define UART_AUTOBAUD_EN_V  0x00000001
#define UART_AUTOBAUD_EN_S  27

/* UART_MEM_CLK_EN : R/W; bitpos: [28]; default: 1;
 * UART memory clock gate enable
 * signal.
 */

#define UART_MEM_CLK_EN    (BIT(28))
#define UART_MEM_CLK_EN_M  (UART_MEM_CLK_EN_V << UART_MEM_CLK_EN_S)
#define UART_MEM_CLK_EN_V  0x00000001
#define UART_MEM_CLK_EN_S  28

/* UART_CONF1_REG register
 *  Configuration register
 *  1
 */

#define UART_CONF1_REG(i) (REG_UART_BASE(i) + 0x24)

/* UART_RXFIFO_FULL_THRHD : R/W; bitpos: [9:0]; default: 96;
 * It will produce rxfifo_full_int interrupt when receiver receives more
 * data than this register
 * value.
 */

#define UART_RXFIFO_FULL_THRHD    0x000001FF
#define UART_RXFIFO_FULL_THRHD_M  (UART_RXFIFO_FULL_THRHD_V << UART_RXFIFO_FULL_THRHD_S)
#define UART_RXFIFO_FULL_THRHD_V  0x000001FF
#define UART_RXFIFO_FULL_THRHD_S  0

/* UART_TXFIFO_EMPTY_THRHD : R/W; bitpos: [18:9]; default: 96;
 * It will produce txfifo_empty_int interrupt when the data amount in
 * Tx-FIFO is less than this register
 * value.
 */

#define UART_TXFIFO_EMPTY_THRHD    0x000001FF
#define UART_TXFIFO_EMPTY_THRHD_M  (UART_TXFIFO_EMPTY_THRHD_V << UART_TXFIFO_EMPTY_THRHD_S)
#define UART_TXFIFO_EMPTY_THRHD_V  0x000001FF
#define UART_TXFIFO_EMPTY_THRHD_S  9

/* UART_DIS_RX_DAT_OVF : R/W; bitpos: [18]; default: 0;
 * Disable UART Rx data overflow
 * detect.
 */

#define UART_DIS_RX_DAT_OVF    (BIT(18))
#define UART_DIS_RX_DAT_OVF_M  (UART_DIS_RX_DAT_OVF_V << UART_DIS_RX_DAT_OVF_S)
#define UART_DIS_RX_DAT_OVF_V  0x00000001
#define UART_DIS_RX_DAT_OVF_S  18

/* UART_RX_TOUT_FLOW_DIS : R/W; bitpos: [19]; default: 0;
 * Set this bit to stop accumulating idle_cnt when hardware flow control
 * works.
 */

#define UART_RX_TOUT_FLOW_DIS    (BIT(19))
#define UART_RX_TOUT_FLOW_DIS_M  (UART_RX_TOUT_FLOW_DIS_V << UART_RX_TOUT_FLOW_DIS_S)
#define UART_RX_TOUT_FLOW_DIS_V  0x00000001
#define UART_RX_TOUT_FLOW_DIS_S  19

/* UART_RX_FLOW_EN : R/W; bitpos: [20]; default: 0;
 * This is the flow enable bit for UART
 * receiver.
 */

#define UART_RX_FLOW_EN    (BIT(20))
#define UART_RX_FLOW_EN_M  (UART_RX_FLOW_EN_V << UART_RX_FLOW_EN_S)
#define UART_RX_FLOW_EN_V  0x00000001
#define UART_RX_FLOW_EN_S  20

/* UART_RX_TOUT_EN : R/W; bitpos: [21]; default: 0;
 * This is the enble bit for uart receiver's timeout
 * function.
 */

#define UART_RX_TOUT_EN    (BIT(21))
#define UART_RX_TOUT_EN_M  (UART_RX_TOUT_EN_V << UART_RX_TOUT_EN_S)
#define UART_RX_TOUT_EN_V  0x00000001
#define UART_RX_TOUT_EN_S  21

/* UART_FLOW_CONF_REG register
 *  Software flow-control
 *  configuration
 */

#define UART_FLOW_CONF_REG(i) (REG_UART_BASE(i) + 0x34)

/* UART_SW_FLOW_CON_EN : R/W; bitpos: [0]; default: 0;
 * Set this bit to enable software flow control. It is used with register
 * sw_xon or
 * sw_xoff.
 */

#define UART_SW_FLOW_CON_EN    (BIT(0))
#define UART_SW_FLOW_CON_EN_M  (UART_SW_FLOW_CON_EN_V << UART_SW_FLOW_CON_EN_S)
#define UART_SW_FLOW_CON_EN_V  0x00000001
#define UART_SW_FLOW_CON_EN_S  0

/* UART_XONOFF_DEL : R/W; bitpos: [1]; default: 0;
 * Set this bit to remove flow control char from the received
 * data.
 */

#define UART_XONOFF_DEL    (BIT(1))
#define UART_XONOFF_DEL_M  (UART_XONOFF_DEL_V << UART_XONOFF_DEL_S)
#define UART_XONOFF_DEL_V  0x00000001
#define UART_XONOFF_DEL_S  1

/* UART_FORCE_XON : R/W; bitpos: [2]; default: 0;
 * Set this bit to enable the transmitter to go on sending
 * data.
 */

#define UART_FORCE_XON    (BIT(2))
#define UART_FORCE_XON_M  (UART_FORCE_XON_V << UART_FORCE_XON_S)
#define UART_FORCE_XON_V  0x00000001
#define UART_FORCE_XON_S  2

/* UART_FORCE_XOFF : R/W; bitpos: [3]; default: 0;
 * Set this bit to stop the  transmitter from sending
 * data.
 */

#define UART_FORCE_XOFF    (BIT(3))
#define UART_FORCE_XOFF_M  (UART_FORCE_XOFF_V << UART_FORCE_XOFF_S)
#define UART_FORCE_XOFF_V  0x00000001
#define UART_FORCE_XOFF_S  3

