apache/nuttx/arch/risc-v/src/esp32c3/hardware/esp32c3_uart.h
/* UART_SEND_XON : R/W/SS/SC; bitpos: [4]; default: 0;
 * Set this bit to send Xon char. It is cleared by hardware
 * automatically.
 */

#define UART_SEND_XON    (BIT(4))
#define UART_SEND_XON_M  (UART_SEND_XON_V << UART_SEND_XON_S)
#define UART_SEND_XON_V  0x00000001
#define UART_SEND_XON_S  4

/* UART_SEND_XOFF : R/W/SS/SC; bitpos: [5]; default: 0;
 * Set this bit to send Xoff char. It is cleared by hardware
 * automatically.
 */

#define UART_SEND_XOFF    (BIT(5))
#define UART_SEND_XOFF_M  (UART_SEND_XOFF_V << UART_SEND_XOFF_S)
#define UART_SEND_XOFF_V  0x00000001
#define UART_SEND_XOFF_S  5

/* UART_SLEEP_CONF_REG register
 *  Sleep-mode
 *  configuration
 */

#define UART_SLEEP_CONF_REG(i) (REG_UART_BASE(i) + 0x38)

/* UART_ACTIVE_THRESHOLD : R/W; bitpos: [10:0]; default: 240;
 * The uart is activated from light sleeping mode when the input rxd edge
 * changes more times than this register
 * value.
 */

#define UART_ACTIVE_THRESHOLD    0x000003FF
#define UART_ACTIVE_THRESHOLD_M  (UART_ACTIVE_THRESHOLD_V << UART_ACTIVE_THRESHOLD_S)
#define UART_ACTIVE_THRESHOLD_V  0x000003FF
#define UART_ACTIVE_THRESHOLD_S  0

/* UART_SWFC_CONF0_REG register
 *  Software flow-control character
 *  configuration
 */

#define UART_SWFC_CONF0_REG(i) (REG_UART_BASE(i) + 0x3c)

/* UART_XOFF_THRESHOLD : R/W; bitpos: [9:0]; default: 224;
 * When the data amount in Rx-FIFO is more than this register value with
 * uart_sw_flow_con_en set to 1, it will send a Xoff
 * char.
 */

#define UART_XOFF_THRESHOLD    0x000001FF
#define UART_XOFF_THRESHOLD_M  (UART_XOFF_THRESHOLD_V << UART_XOFF_THRESHOLD_S)
#define UART_XOFF_THRESHOLD_V  0x000001FF
#define UART_XOFF_THRESHOLD_S  0

/* UART_XOFF_CHAR : R/W; bitpos: [17:9]; default: 19;
 * This register stores the Xoff flow control
 * char.
 */

#define UART_XOFF_CHAR    0x000000FF
#define UART_XOFF_CHAR_M  (UART_XOFF_CHAR_V << UART_XOFF_CHAR_S)
#define UART_XOFF_CHAR_V  0x000000FF
#define UART_XOFF_CHAR_S  9

/* UART_SWFC_CONF1_REG register
 *  Software flow-control character
 *  configuration
 */

#define UART_SWFC_CONF1_REG(i) (REG_UART_BASE(i) + 0x40)

/* UART_XON_THRESHOLD : R/W; bitpos: [9:0]; default: 0;
 * When the data amount in Rx-FIFO is less than this register value with
 * uart_sw_flow_con_en set to 1, it will send a Xon
 * char.
 */

#define UART_XON_THRESHOLD    0x000001FF
#define UART_XON_THRESHOLD_M  (UART_XON_THRESHOLD_V << UART_XON_THRESHOLD_S)
#define UART_XON_THRESHOLD_V  0x000001FF
#define UART_XON_THRESHOLD_S  0

/* UART_XON_CHAR : R/W; bitpos: [17:9]; default: 17;
 * This register stores the Xon flow control
 * char.
 */

#define UART_XON_CHAR    0x000000FF
#define UART_XON_CHAR_M  (UART_XON_CHAR_V << UART_XON_CHAR_S)
#define UART_XON_CHAR_V  0x000000FF
#define UART_XON_CHAR_S  9

/* UART_TXBRK_CONF_REG register
 *  Tx Break character
 *  configuration
 */

#define UART_TXBRK_CONF_REG(i) (REG_UART_BASE(i) + 0x44)

/* UART_TX_BRK_NUM : R/W; bitpos: [8:0]; default: 10;
 * This register is used to configure the number of 0 to be sent after the
 * process of sending data is done. It is active when txd_brk is set to
 * 1.
 */

#define UART_TX_BRK_NUM    0x000000FF
#define UART_TX_BRK_NUM_M  (UART_TX_BRK_NUM_V << UART_TX_BRK_NUM_S)
#define UART_TX_BRK_NUM_V  0x000000FF
#define UART_TX_BRK_NUM_S  0

/* UART_IDLE_CONF_REG register
 *  Frame-end idle
 *  configuration
 */

#define UART_IDLE_CONF_REG(i) (REG_UART_BASE(i) + 0x48)

/* UART_RX_IDLE_THRHD : R/W; bitpos: [10:0]; default: 256;
 * It will produce frame end signal when receiver takes more time to
 * receive one byte data than this register
 * value.
 */

#define UART_RX_IDLE_THRHD    0x000003FF
#define UART_RX_IDLE_THRHD_M  (UART_RX_IDLE_THRHD_V << UART_RX_IDLE_THRHD_S)
#define UART_RX_IDLE_THRHD_V  0x000003FF
#define UART_RX_IDLE_THRHD_S  0

/* UART_TX_IDLE_NUM : R/W; bitpos: [20:10]; default: 256;
 * This register is used to configure the duration time between
 * transfers.
 */

#define UART_TX_IDLE_NUM    0x000003FF
#define UART_TX_IDLE_NUM_M  (UART_TX_IDLE_NUM_V << UART_TX_IDLE_NUM_S)
#define UART_TX_IDLE_NUM_V  0x000003FF
#define UART_TX_IDLE_NUM_S  10

/* UART_RS485_CONF_REG register
 *  RS485 mode
 *  configuration
 */

#define UART_RS485_CONF_REG(i) (REG_UART_BASE(i) + 0x4c)

/* UART_RS485_EN : R/W; bitpos: [0]; default: 0;
 * Set this bit to choose the rs485
 * mode.
 */

#define UART_RS485_EN    (BIT(0))
#define UART_RS485_EN_M  (UART_RS485_EN_V << UART_RS485_EN_S)
#define UART_RS485_EN_V  0x00000001
#define UART_RS485_EN_S  0

/* UART_DL0_EN : R/W; bitpos: [1]; default: 0;
 * Set this bit to delay the stop bit by 1
 * bit.
 */

#define UART_DL0_EN    (BIT(1))
#define UART_DL0_EN_M  (UART_DL0_EN_V << UART_DL0_EN_S)
#define UART_DL0_EN_V  0x00000001
#define UART_DL0_EN_S  1

/* UART_DL1_EN : R/W; bitpos: [2]; default: 0;
 * Set this bit to delay the stop bit by 1
 * bit.
 */

#define UART_DL1_EN    (BIT(2))
#define UART_DL1_EN_M  (UART_DL1_EN_V << UART_DL1_EN_S)
#define UART_DL1_EN_V  0x00000001
#define UART_DL1_EN_S  2

/* UART_RS485TX_RX_EN : R/W; bitpos: [3]; default: 0;
 * Set this bit to enable receiver could receive data when the transmitter
 * is transmitting data in rs485
 * mode.
 */

#define UART_RS485TX_RX_EN    (BIT(3))
#define UART_RS485TX_RX_EN_M  (UART_RS485TX_RX_EN_V << UART_RS485TX_RX_EN_S)
#define UART_RS485TX_RX_EN_V  0x00000001
#define UART_RS485TX_RX_EN_S  3

/* UART_RS485RXBY_TX_EN : R/W; bitpos: [4]; default: 0;
 * 1'h1: enable rs485 transmitter to send data when rs485 receiver line is
 * busy.
 */

#define UART_RS485RXBY_TX_EN    (BIT(4))
#define UART_RS485RXBY_TX_EN_M  (UART_RS485RXBY_TX_EN_V << UART_RS485RXBY_TX_EN_S)
#define UART_RS485RXBY_TX_EN_V  0x00000001
#define UART_RS485RXBY_TX_EN_S  4

/* UART_RS485_RX_DLY_NUM : R/W; bitpos: [5]; default: 0;
 * This register is used to delay the receiver's internal data
 * signal.
 */

#define UART_RS485_RX_DLY_NUM    (BIT(5))
#define UART_RS485_RX_DLY_NUM_M  (UART_RS485_RX_DLY_NUM_V << UART_RS485_RX_DLY_NUM_S)
#define UART_RS485_RX_DLY_NUM_V  0x00000001
#define UART_RS485_RX_DLY_NUM_S  5

/* UART_RS485_TX_DLY_NUM : R/W; bitpos: [10:6]; default: 0;
 * This register is used to delay the transmitter's internal data
 * signal.
 */

#define UART_RS485_TX_DLY_NUM    0x0000000F
#define UART_RS485_TX_DLY_NUM_M  (UART_RS485_TX_DLY_NUM_V << UART_RS485_TX_DLY_NUM_S)
#define UART_RS485_TX_DLY_NUM_V  0x0000000F
#define UART_RS485_TX_DLY_NUM_S  6

