apache/nuttx/arch/risc-v/src/esp32c3/hardware/esp32c3_uart.h
/* UART_CLK_CONF_REG register
 *  UART core clock
 *  configuration
 */

#define UART_CLK_CONF_REG(i) (REG_UART_BASE(i) + 0x78)

/* UART_SCLK_DIV_B : R/W; bitpos: [6:0]; default: 0;
 * The  denominator of the frequency divider
 * factor.
 */

#define UART_SCLK_DIV_B    0x0000003F
#define UART_SCLK_DIV_B_M  (UART_SCLK_DIV_B_V << UART_SCLK_DIV_B_S)
#define UART_SCLK_DIV_B_V  0x0000003F
#define UART_SCLK_DIV_B_S  0

/* UART_SCLK_DIV_A : R/W; bitpos: [12:6]; default: 0;
 * The numerator of the frequency divider
 * factor.
 */

#define UART_SCLK_DIV_A    0x0000003F
#define UART_SCLK_DIV_A_M  (UART_SCLK_DIV_A_V << UART_SCLK_DIV_A_S)
#define UART_SCLK_DIV_A_V  0x0000003F
#define UART_SCLK_DIV_A_S  6

/* UART_SCLK_DIV_NUM : R/W; bitpos: [20:12]; default: 1;
 * The integral part of the frequency divider
 * factor.
 */

#define UART_SCLK_DIV_NUM    0x000000FF
#define UART_SCLK_DIV_NUM_M  (UART_SCLK_DIV_NUM_V << UART_SCLK_DIV_NUM_S)
#define UART_SCLK_DIV_NUM_V  0x000000FF
#define UART_SCLK_DIV_NUM_S  12

/* UART_SCLK_SEL : R/W; bitpos: [22:20]; default: 3;
 * UART clock source select. 1: 80Mhz, 2: 8Mhz, 3:
 * XTAL.
 */

#define UART_SCLK_SEL    0x00000003
#define UART_SCLK_SEL_M  (UART_SCLK_SEL_V << UART_SCLK_SEL_S)
#define UART_SCLK_SEL_V  0x00000003
#define UART_SCLK_SEL_S  20

/* UART_SCLK_EN : R/W; bitpos: [22]; default: 1;
 * Set this bit to enable UART Tx/Rx
 * clock.
 */

#define UART_SCLK_EN    (BIT(22))
#define UART_SCLK_EN_M  (UART_SCLK_EN_V << UART_SCLK_EN_S)
#define UART_SCLK_EN_V  0x00000001
#define UART_SCLK_EN_S  22

/* UART_RST_CORE : R/W; bitpos: [23]; default: 0;
 * Write 1 then write 0 to this bit, reset UART
 * Tx/Rx.
 */

#define UART_RST_CORE    (BIT(23))
#define UART_RST_CORE_M  (UART_RST_CORE_V << UART_RST_CORE_S)
#define UART_RST_CORE_V  0x00000001
#define UART_RST_CORE_S  23

/* UART_TX_SCLK_EN : R/W; bitpos: [24]; default: 1;
 * Set this bit to enable UART Tx
 * clock.
 */

#define UART_TX_SCLK_EN    (BIT(24))
#define UART_TX_SCLK_EN_M  (UART_TX_SCLK_EN_V << UART_TX_SCLK_EN_S)
#define UART_TX_SCLK_EN_V  0x00000001
#define UART_TX_SCLK_EN_S  24

/* UART_RX_SCLK_EN : R/W; bitpos: [25]; default: 1;
 * Set this bit to enable UART Rx
 * clock.
 */

#define UART_RX_SCLK_EN    (BIT(25))
#define UART_RX_SCLK_EN_M  (UART_RX_SCLK_EN_V << UART_RX_SCLK_EN_S)
#define UART_RX_SCLK_EN_V  0x00000001
#define UART_RX_SCLK_EN_S  25

/* UART_TX_RST_CORE : R/W; bitpos: [26]; default: 0;
 * Write 1 then write 0 to this bit, reset UART
 * Tx.
 */

#define UART_TX_RST_CORE    (BIT(26))
#define UART_TX_RST_CORE_M  (UART_TX_RST_CORE_V << UART_TX_RST_CORE_S)
#define UART_TX_RST_CORE_V  0x00000001
#define UART_TX_RST_CORE_S  26

/* UART_RX_RST_CORE : R/W; bitpos: [27]; default: 0;
 * Write 1 then write 0 to this bit, reset UART
 * Rx.
 */

#define UART_RX_RST_CORE    (BIT(27))
#define UART_RX_RST_CORE_M  (UART_RX_RST_CORE_V << UART_RX_RST_CORE_S)
#define UART_RX_RST_CORE_V  0x00000001
#define UART_RX_RST_CORE_S  27

/* Status Register */

/* UART_STATUS_REG register
 *  UART status
 *  register
 */

#define UART_STATUS_REG(i) (REG_UART_BASE(i) + 0x1c)

/* UART_RXFIFO_CNT : RO; bitpos: [10:0]; default: 0;
 * Stores the byte number of valid data in
 * Rx-FIFO.
 */

#define UART_RXFIFO_CNT    0x000003FF
#define UART_RXFIFO_CNT_M  (UART_RXFIFO_CNT_V << UART_RXFIFO_CNT_S)
#define UART_RXFIFO_CNT_V  0x000003FF
#define UART_RXFIFO_CNT_S  0

/* UART_DSRN : RO; bitpos: [13]; default: 0;
 * The register represent the level value of the internal uart dsr
 * signal.
 */

#define UART_DSRN    (BIT(13))
#define UART_DSRN_M  (UART_DSRN_V << UART_DSRN_S)
#define UART_DSRN_V  0x00000001
#define UART_DSRN_S  13

/* UART_CTSN : RO; bitpos: [14]; default: 1;
 * This register represent the level value of the internal uart cts
 * signal.
 */

#define UART_CTSN    (BIT(14))
#define UART_CTSN_M  (UART_CTSN_V << UART_CTSN_S)
#define UART_CTSN_V  0x00000001
#define UART_CTSN_S  14

/* UART_RXD : RO; bitpos: [15]; default: 1;
 * This register represent the  level value of the internal uart rxd
 * signal.
 */

#define UART_RXD    (BIT(15))
#define UART_RXD_M  (UART_RXD_V << UART_RXD_S)
#define UART_RXD_V  0x00000001
#define UART_RXD_S  15

/* UART_TXFIFO_CNT : RO; bitpos: [26:16]; default: 0;
 * Stores the byte number of data in
 * Tx-FIFO.
 */

#define UART_TXFIFO_CNT    0x000003FF
#define UART_TXFIFO_CNT_M  (UART_TXFIFO_CNT_V << UART_TXFIFO_CNT_S)
#define UART_TXFIFO_CNT_V  0x000003FF
#define UART_TXFIFO_CNT_S  16

/* UART_DTRN : RO; bitpos: [29]; default: 1;
 * This bit represents the level of the internal uart dtr
 * signal.
 */

#define UART_DTRN    (BIT(29))
#define UART_DTRN_M  (UART_DTRN_V << UART_DTRN_S)
#define UART_DTRN_V  0x00000001
#define UART_DTRN_S  29

/* UART_RTSN : RO; bitpos: [30]; default: 1;
 * This bit represents the level of the internal uart rts
 * signal.
 */

#define UART_RTSN    (BIT(30))
#define UART_RTSN_M  (UART_RTSN_V << UART_RTSN_S)
#define UART_RTSN_V  0x00000001
#define UART_RTSN_S  30

/* UART_TXD : RO; bitpos: [31]; default: 1;
 * This bit represents the  level of the internal uart txd
 * signal.
 */

#define UART_TXD    (BIT(31))
#define UART_TXD_M  (UART_TXD_V << UART_TXD_S)
#define UART_TXD_V  0x00000001
#define UART_TXD_S  31

/* UART_MEM_TX_STATUS_REG register
 *  Tx-FIFO write and read offset
 *  address.
 */

#define UART_MEM_TX_STATUS_REG(i) (REG_UART_BASE(i) + 0x64)

/* UART_APB_TX_WADDR : RO; bitpos: [10:0]; default: 0;
 * This register stores the offset address in Tx-FIFO when software writes
 * Tx-FIFO via
 * APB.
 */

#define UART_APB_TX_WADDR    0x000003FF
#define UART_APB_TX_WADDR_M  (UART_APB_TX_WADDR_V << UART_APB_TX_WADDR_S)
#define UART_APB_TX_WADDR_V  0x000003FF
#define UART_APB_TX_WADDR_S  0

/* UART_TX_RADDR : RO; bitpos: [21:11]; default: 0;
 * This register stores the offset address in Tx-FIFO when Tx-FSM reads
 * data via
 * Tx-FIFO_Ctrl.
 */

#define UART_TX_RADDR    0x000003FF
#define UART_TX_RADDR_M  (UART_TX_RADDR_V << UART_TX_RADDR_S)
#define UART_TX_RADDR_V  0x000003FF
#define UART_TX_RADDR_S  11

/* UART_MEM_RX_STATUS_REG register
 *  Rx-FIFO write and read offset
 *  address.
 */

#define UART_MEM_RX_STATUS_REG(i) (REG_UART_BASE(i) + 0x68)

