apache/nuttx/arch/risc-v/src/esp32c3/hardware/esp32c3_uart.h
/* UART_APB_RX_RADDR : RO; bitpos: [10:0]; default: 256;
 * This register stores the offset address in RX-FIFO when software reads
 * data from Rx-FIFO via APB. UART0 is 10'h100. UART1 is
 * 10'h180.
 */

#define UART_APB_RX_RADDR    0x000003FF
#define UART_APB_RX_RADDR_M  (UART_APB_RX_RADDR_V << UART_APB_RX_RADDR_S)
#define UART_APB_RX_RADDR_V  0x000003FF
#define UART_APB_RX_RADDR_S  0

/* UART_RX_WADDR : RO; bitpos: [21:11]; default: 256;
 * This register stores the offset address in Rx-FIFO when Rx-FIFO_Ctrl
 * writes Rx-FIFO. UART0 is 10'h100. UART1 is
 * 10'h180.
 */

#define UART_RX_WADDR    0x000003FF
#define UART_RX_WADDR_M  (UART_RX_WADDR_V << UART_RX_WADDR_S)
#define UART_RX_WADDR_V  0x000003FF
#define UART_RX_WADDR_S  11

/* UART_FSM_STATUS_REG register
 *  UART transmit and receive
 *  status.
 */

#define UART_FSM_STATUS_REG(i) (REG_UART_BASE(i) + 0x6c)

/* UART_ST_URX_OUT : RO; bitpos: [4:0]; default: 0;
 * This is the status register of
 * receiver.
 */

#define UART_ST_URX_OUT    0x0000000F
#define UART_ST_URX_OUT_M  (UART_ST_URX_OUT_V << UART_ST_URX_OUT_S)
#define UART_ST_URX_OUT_V  0x0000000F
#define UART_ST_URX_OUT_S  0

/* UART_ST_UTX_OUT : RO; bitpos: [8:4]; default: 0;
 * This is the status register of
 * transmitter.
 */

#define UART_ST_UTX_OUT    0x0000000F
#define UART_ST_UTX_OUT_M  (UART_ST_UTX_OUT_V << UART_ST_UTX_OUT_S)
#define UART_ST_UTX_OUT_V  0x0000000F
#define UART_ST_UTX_OUT_S  4

/* Autobaud Register */

/* UART_LOWPULSE_REG register
 *  Autobaud minimum low pulse duration
 *  register
 */

#define UART_LOWPULSE_REG(i) (REG_UART_BASE(i) + 0x28)

/* UART_LOWPULSE_MIN_CNT : RO; bitpos: [12:0]; default: 4095;
 * This register stores the value of the minimum duration time of the low
 * level pulse. It is used in baud rate-detect
 * process.
 */

#define UART_LOWPULSE_MIN_CNT    0x00000FFF
#define UART_LOWPULSE_MIN_CNT_M  (UART_LOWPULSE_MIN_CNT_V << UART_LOWPULSE_MIN_CNT_S)
#define UART_LOWPULSE_MIN_CNT_V  0x00000FFF
#define UART_LOWPULSE_MIN_CNT_S  0

/* UART_HIGHPULSE_REG register
 *  Autobaud minimum high pulse duration
 *  register
 */

#define UART_HIGHPULSE_REG(i) (REG_UART_BASE(i) + 0x2c)

/* UART_HIGHPULSE_MIN_CNT : RO; bitpos: [12:0]; default: 4095;
 * This register stores  the value of the maxinum duration time for the
 * high level pulse. It is used in baud rate-detect
 * process.
 */

#define UART_HIGHPULSE_MIN_CNT    0x00000FFF
#define UART_HIGHPULSE_MIN_CNT_M  (UART_HIGHPULSE_MIN_CNT_V << UART_HIGHPULSE_MIN_CNT_S)
#define UART_HIGHPULSE_MIN_CNT_V  0x00000FFF
#define UART_HIGHPULSE_MIN_CNT_S  0

/* UART_RXD_CNT_REG register
 *  Autobaud edge change count
 *  register
 */

#define UART_RXD_CNT_REG(i) (REG_UART_BASE(i) + 0x30)

/* UART_RXD_EDGE_CNT : RO; bitpos: [10:0]; default: 0;
 * This register stores the count of rxd edge change. It is used in baud
 * rate-detect
 * process.
 */

#define UART_RXD_EDGE_CNT    0x000003FF
#define UART_RXD_EDGE_CNT_M  (UART_RXD_EDGE_CNT_V << UART_RXD_EDGE_CNT_S)
#define UART_RXD_EDGE_CNT_V  0x000003FF
#define UART_RXD_EDGE_CNT_S  0

/* UART_POSPULSE_REG register
 *  Autobaud high pulse
 *  register
 */

#define UART_POSPULSE_REG(i) (REG_UART_BASE(i) + 0x70)

/* UART_POSEDGE_MIN_CNT : RO; bitpos: [12:0]; default: 4095;
 * This register stores the minimal input clock count between two positive
 * edges. It is used in boudrate-detect
 * process.
 */

#define UART_POSEDGE_MIN_CNT    0x00000FFF
#define UART_POSEDGE_MIN_CNT_M  (UART_POSEDGE_MIN_CNT_V << UART_POSEDGE_MIN_CNT_S)
#define UART_POSEDGE_MIN_CNT_V  0x00000FFF
#define UART_POSEDGE_MIN_CNT_S  0

/* UART_NEGPULSE_REG register
 *  Autobaud low pulse
 *  register
 */

#define UART_NEGPULSE_REG(i) (REG_UART_BASE(i) + 0x74)

/* UART_NEGEDGE_MIN_CNT : RO; bitpos: [12:0]; default: 4095;
 * This register stores the minimal input clock count between two negative
 * edges. It is used in boudrate-detect
 * process.
 */

#define UART_NEGEDGE_MIN_CNT    0x00000FFF
#define UART_NEGEDGE_MIN_CNT_M  (UART_NEGEDGE_MIN_CNT_V << UART_NEGEDGE_MIN_CNT_S)
#define UART_NEGEDGE_MIN_CNT_V  0x00000FFF
#define UART_NEGEDGE_MIN_CNT_S  0

/* AT Escape Sequence Selection Configuration */

/* UART_AT_CMD_PRECNT_REG register
 *  Pre-sequence timing
 *  configuration
 */

#define UART_AT_CMD_PRECNT_REG(i) (REG_UART_BASE(i) + 0x50)

/* UART_PRE_IDLE_NUM : R/W; bitpos: [16:0]; default: 2305;
 * This register is used to configure the idle duration time before the
 * first at_cmd is received by
 * receiver.
 */

#define UART_PRE_IDLE_NUM    0x0000FFFF
#define UART_PRE_IDLE_NUM_M  (UART_PRE_IDLE_NUM_V << UART_PRE_IDLE_NUM_S)
#define UART_PRE_IDLE_NUM_V  0x0000FFFF
#define UART_PRE_IDLE_NUM_S  0

/* UART_AT_CMD_POSTCNT_REG register
 *  Post-sequence timing
 *  configuration
 */

#define UART_AT_CMD_POSTCNT_REG(i) (REG_UART_BASE(i) + 0x54)

/* UART_POST_IDLE_NUM : R/W; bitpos: [16:0]; default: 2305;
 * This register is used to configure the duration time between the last
 * at_cmd and the next
 * data.
 */

#define UART_POST_IDLE_NUM    0x0000FFFF
#define UART_POST_IDLE_NUM_M  (UART_POST_IDLE_NUM_V << UART_POST_IDLE_NUM_S)
#define UART_POST_IDLE_NUM_V  0x0000FFFF
#define UART_POST_IDLE_NUM_S  0

/* UART_AT_CMD_GAPTOUT_REG register
 *  Timeout
 *  configuration
 */

#define UART_AT_CMD_GAPTOUT_REG(i) (REG_UART_BASE(i) + 0x58)

/* UART_RX_GAP_TOUT : R/W; bitpos: [16:0]; default: 11;
 * This register is used to configure the duration time between the at_cmd
 * chars.
 */

#define UART_RX_GAP_TOUT    0x0000FFFF
#define UART_RX_GAP_TOUT_M  (UART_RX_GAP_TOUT_V << UART_RX_GAP_TOUT_S)
#define UART_RX_GAP_TOUT_V  0x0000FFFF
#define UART_RX_GAP_TOUT_S  0

/* UART_AT_CMD_CHAR_REG register
 *  AT escape sequence detection
 *  configuration
 */

#define UART_AT_CMD_CHAR_REG(i) (REG_UART_BASE(i) + 0x5c)

/* UART_AT_CMD_CHAR : R/W; bitpos: [8:0]; default: 43;
 * This register is used to configure the content of at_cmd
 * char.
 */

#define UART_AT_CMD_CHAR    0x000000FF
#define UART_AT_CMD_CHAR_M  (UART_AT_CMD_CHAR_V << UART_AT_CMD_CHAR_S)
#define UART_AT_CMD_CHAR_V  0x000000FF
#define UART_AT_CMD_CHAR_S  0

/* UART_CHAR_NUM : R/W; bitpos: [16:8]; default: 3;
 * This register is used to configure the num of continuous at_cmd chars
 * received by
 * receiver.
 */

#define UART_CHAR_NUM    0x000000FF
#define UART_CHAR_NUM_M  (UART_CHAR_NUM_V << UART_CHAR_NUM_S)
#define UART_CHAR_NUM_V  0x000000FF
#define UART_CHAR_NUM_S  8

/* Version Register */

/* UART_DATE_REG register
 *  UART Version
 *  register
 */

#define UART_DATE_REG(i) (REG_UART_BASE(i) + 0x7c)

/* UART_DATE : R/W; bitpos: [32:0]; default: 33587824;
 * This is the version
 * register.
 */

#define UART_DATE    0xFFFFFFFF
#define UART_DATE_M  (UART_DATE_V << UART_DATE_S)
#define UART_DATE_V  0xFFFFFFFF
#define UART_DATE_S  0

/* UART_ID_REG register
 *  UART ID
 *  register
 */

#define UART_ID_REG(i) (REG_UART_BASE(i) + 0x80)

/* UART_ID : R/W; bitpos: [30:0]; default: 1280;
 * This register is used to configure the
 * uart_id.
 */

#define UART_ID    0x3FFFFFFF
#define UART_ID_M  (UART_ID_V << UART_ID_S)
#define UART_ID_V  0x3FFFFFFF
#define UART_ID_S  0

/* UART_HIGH_SPEED : R/W; bitpos: [30]; default: 1;
 * This bit used to select synchronize mode. 1: Registers are auto
 * synchronized into UART Core clock and UART core should be keep the same
 * with APB clock. 0: After configure registers, software needs to write 1
 * to UART_REG_UPDATE to synchronize
 * registers.
 */

#define UART_HIGH_SPEED    (BIT(30))
#define UART_HIGH_SPEED_M  (UART_HIGH_SPEED_V << UART_HIGH_SPEED_S)
#define UART_HIGH_SPEED_V  0x00000001
#define UART_HIGH_SPEED_S  30

/* UART_REG_UPDATE : R/W/SC; bitpos: [31]; default: 0;
 * Software write 1 would synchronize registers into UART Core clock
 * domain and would be cleared by hardware after synchronization is
 * done.
 */

#define UART_REG_UPDATE    (BIT(31))
#define UART_REG_UPDATE_M  (UART_REG_UPDATE_V << UART_REG_UPDATE_S)
#define UART_REG_UPDATE_V  0x00000001
#define UART_REG_UPDATE_S  31

#endif /* __ARCH_RISCV_SRC_ESP32C3_HARDWARE_ESP32C3_UART_H */